Table of Contents
 Interface IGrpcCommunicator
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
public interface IGrpcCommunicator
Properties
 Host
The host
string Host { get; }
Property Value
string
 Port
Port on which the communicator will communicate.
int Port { get; }
Property Value
int
Methods
 StartAsync(string, int)
Starts gRPC communication
Task StartAsync(string clientId, int port)
Parameters
clientId string
Current client ID (PID)
port int
Port on which the server is running.
Returns
Task
 StopAsync()
Stopos gRPC communication
Task StopAsync()
Returns
Task
 Edit this page